Revit 2027 API
ComponentRepeaterSlot.IsTypeValidForSlot Method
 Determines whether instance of given family type can be used in the component repeater slot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTypeValidForSlot(
	ElementId typeId
)
Public Function IsTypeValidForSlot (
	typeId As ElementId
) As Boolean
public:
bool IsTypeValidForSlot(
	ElementId^ typeId
)
member IsTypeValidForSlot :
        typeId : ElementId -> bool
Parameters
typeId ElementId
 The element id of the type.
Return Value
Boolean
 True if the family type can be used in the component repeater slot.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace